Tekla Open API Reference for Tekla Structures 2025
View.ViewRenderingType Enumeration
 The view rendering types. Only rendered views can be modified.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ViewRenderingType
Public Enumeration ViewRenderingType
Members
Member name | Value | Description
WIREFRAME_VIEW | 0 |  The wireframe view type.
RENDERED_VIEW | 1 |  The rendered view type.
See Also
Reference
Tekla.Structures.Model.UI Namespace